V03/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.00003971;//1e-5;
bcField uniform 0.00000000001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            calculated;
        value           $internalField;
    }

    staticWalls
    {
        //type            zeroGradient; 
	type            nutkWallFunction;
        value           $internalField;
    }

    movingWalls
    {
        $staticWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
